[
    {
        "title": "Traffic Violations",
        "online": [
            "1. Visit the official E-Challan tracker & payment portal.",
            "2. Enter your Challan number / vehicle number / DL number and violation details.",
            "3. Review the fine amount and details.",
            "4. Proceed to payment using your preferred method (credit card, net banking).",
            "5. Save the payment receipt for your records."
        ],
        "offline": [
            "1. Visit your local traffic police station with the necessary documents.",
            "2. Fill out the Traffic Violation Form.",
            "3. Submit the form along with any supporting documents (e.g., license, vehicle registration).",
            "4. Make the payment at the station and obtain a receipt."
        ],
        "documents": [
            {
                "name": "Driving License",
                "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do"
            },
            {
                "name": "Vehicle Registration Certificate",
                "link": "https://vahan.parivahan.gov.in/vahanservice/vahan/ui/onlineservice/form_print_Rc.xhtml"
            },
            {
                "name": "Address and identity proof (Aadhar, Pan card etc.)",
                "link": "https://www.digilocker.gov.in/"
            }
        ]
    },
    {
        "title": "Corporate Fine / Penalty",
        "online": [
            "1. Visit the Ministry of Corporate Affairs (MCA) portal.",
            "2. Navigate to 'Forms & Downloads' and choose the appropriate forms (e.g., GNL-1, AOC-4).",
            "3. Fill out the required forms with details of the offense and supporting documents.",
            "4. Submit the form online and make the payment via credit card, net banking, or debit card.",
            "5. Save the acknowledgment and payment receipt for future reference."
        ],
        "offline": [
            "1. Visit the nearest Regional Director (RD) or Registrar of Companies (ROC) office.",
            "2. Submit the relevant forms (e.g., GNL-1, AOC-4) along with required documents like board resolutions, AGM details, and violation notices.",
            "3. Pay the fine/penalty in person at the office and collect a receipt.",
            "4. Retain the receipt and filed documents for future reference."
        ],
        "documents": [
            {
                "name": "Form GNL-1 (for compounding offenses)",
                "link": "https://www.mca.gov.in/"
            },
            {
                "name": "Form AOC-4 (for financial statement filings)",
                "link": "https://www.mca.gov.in/"
            },
            {
                "name": "Board Resolution",
                "link": "https://www.mca.gov.in/"
            },
            {
                "name": "Annual General Meeting details",
                "link": "https://www.mca.gov.in/"
            }
        ]
    },
    {
        "title": "Individual Fines",
        "online": [
            "1. Visit the eCourt Services portal. Or you can proceed with an alternative payment portal.",
            "2. Select your state or district and enter details like CNR number, case registration number, or party name.",
            "3. Follow the instructions to view the fine details and proceed with payment.",
            "4. Choose a payment method such as net banking or UPI.",
            "5. Download the payment receipt for your records."
        ],
        "offline": [
            "1. Visit your local court or government office.",
            "2. Request the 'Individual Fine Payment Form.'",
            "3. Fill in the form with required personal details and attach the necessary documents.",
            "4. Make the payment at the designated counter and collect the receipt."
        ],
        "documents": [
            {
                "name": "None"
            }
        ]
    }
]